In [1]:
import sqlalchemy as sa

engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Employees')

In [2]:
%load_ext sql
%sql $engine.url

In [3]:
%%sql 
SELECT * 
FROM employees 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/Employees
10 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12)),
 (10006, datetime.date(1953, 4, 20), 'Anneke', 'Preusig', 'F', datetime.date(1989, 6, 2)),
 (10007, datetime.date(1957, 5, 23), 'Tzvetan', 'Zielinski', 'F', datetime.date(1989, 2, 10)),
 (10008, datetime.date(1958, 2, 19), 'Saniya', 'Kalloufi', 'M', datetime.date(1994, 9, 15)),
 (10009, datetime.date(1952, 4, 19), 'Sumant', 'Peac', 'F', datetime.date(1985, 2, 18)),
 (10010, datetime.date(1963, 6, 1), 'Duangkaew', 'Piveteau', 'F', datetime.date(1989, 8, 24))]

In [4]:
%%sql
SELECT * FROM departments;

 * postgresql://postgres:***@localhost:5432/Employees
9 rows affected.

[('d001', 'Marketing'),
 ('d002', 'Finance'),
 ('d003', 'Human Resources'),
 ('d004', 'Production'),
 ('d005', 'Development'),
 ('d006', 'Quality Management'),
 ('d007', 'Sales'),
 ('d008', 'Research'),
 ('d009', 'Customer Service')]

In [5]:
%%sql
-- rename column
SELECT emp_no as "Employee #", 
       birth_date as "Birthdat", 
       first_name as "First Name" 
FROM employees
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi'),
 (10002, datetime.date(1964, 6, 2), 'Bezalel'),
 (10003, datetime.date(1959, 12, 3), 'Parto'),
 (10004, datetime.date(1954, 5, 1), 'Chirstian'),
 (10005, datetime.date(1955, 1, 21), 'Kyoichi')]

In [6]:
%%sql
-- column concatenation
-- use single quote (' ') for text in concat
SELECT CONCAT(emp_no, ' is a ', title) as "Employee Titles" from titles
limit 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[('10001 is a Senior Engineer',),
 ('10002 is a Staff',),
 ('10003 is a Senior Engineer',),
 ('10004 is a Engineer',),
 ('10004 is a Senior Engineer',)]

In [7]:
%%sql
SELECT emp_no, CONCAT(first_name, ' ', last_name) as "full name" from employees
limit 5

 * postgresql://postgres:***@localhost:5432/Employees
5 rows affected.

[(10001, 'Georgi Facello'),
 (10002, 'Bezalel Simmel'),
 (10003, 'Parto Bamford'),
 (10004, 'Chirstian Koblick'),
 (10005, 'Kyoichi Maliniak')]

In [8]:
%%sql
-- aggregate function
SELECT count(emp_no) FROM employees

 * postgresql://postgres:***@localhost:5432/Employees
1 rows affected.

[(300024,)]

In [9]:
%%sql
SELECT max(salary) FROM salaries

 * postgresql://postgres:***@localhost:5432/Employees
1 rows affected.

[(158220,)]

In [10]:
%%sql
SELECT sum(salary) FROM salaries

 * postgresql://postgres:***@localhost:5432/Employees
1 rows affected.

[(181480757419,)]

In [11]:
%%sql
-- fillter
select first_name, last_name FROM employees
WHERE first_name = 'Mayumi' AND last_name = 'Schueller'

 * postgresql://postgres:***@localhost:5432/Employees
1 rows affected.

[('Mayumi', 'Schueller')]

In [14]:
%%sql
-- and, or operation order
select first_name, last_name, gender, hire_date FROM employees
WHERE (first_name = 'Georgi' AND last_name = 'Facello' AND hire_date = '1986-06-26') OR (first_name = 'Bezalel' AND last_name = 'Simmel')
LIMIT 5

 * postgresql://postgres:***@localhost:5432/Employees
2 rows affected.

[('Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 ('Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21))]

In [19]:
engine = sa.create_engine('postgresql://postgres:root@localhost:5432/Store')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [21]:
%%sql

SELECT firstname, lastname, gender, state FROM customers
WHERE (state = 'OR' or state = 'NY') AND gender = 'F'
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
5 rows affected.

[('NPSFGQ', 'NAYJFNKHRQ', 'F', 'NY'),
 ('IIGRBQ', 'OUCWDXMWAB', 'F', 'NY'),
 ('YFHHCI', 'VZVOWBWKTG', 'F', 'NY'),
 ('LQPAAP', 'PHCMXEWHIV', 'F', 'OR'),
 ('RSCFDI', 'RXUAFLXMNX', 'F', 'NY')]

In [22]:
%%sql

SELECT COUNT(*) FROM customers
WHERE NOT age = 55
LIMIT 5

   postgresql://postgres:***@localhost:5432/Employees
 * postgresql://postgres:***@localhost:5432/Store
1 rows affected.

[(19716,)]